cf_billing/InformationRegisters/энргСостояниеПриборовМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПриборыУзловУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПриборыУзловУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИзмерителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПриборыТочекМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПриборыТочекМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовУзловУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовУзловУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИзмерителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПриборовУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ввод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вывод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПоверке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет действующие приборы учета МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДействующиеПриборыУчетаМКД(Схема, ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргПриборыУзловУчетаМКД.ПриборыУзловУчетаМКД(Схема,ПараметрыОтбора,"ПриборыУзловУчета"); 
	Иначе		
		ЕстьПриборыДействующихТочек 		= Ложь;	
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ПриборыУзловУчета" Тогда
				ЕстьПриборыДействующихТочек = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьПриборыДействующихТочек Тогда
			РегистрыСведений.энргПриборыУзловУчетаМКД.ПриборыУзловУчетаМКД(Схема,ПараметрыОтбора,"ПриборыУзловУчета");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующиеПриборыУчетаМКД());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
			
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет активные приборы учета МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура АктивныеПриборыУчетаМКД(Схема, ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргПриборыТочекМКД.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочекМКД"); 
	Иначе		
		ЕстьПриборыДействующихТочек 		= Ложь;	
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ПриборыДействующихТочекМКД" Тогда
				ЕстьПриборыДействующихТочек = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьПриборыДействующихТочек Тогда
			РегистрыСведений.энргПриборыТочекМКД.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочекМКД");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктивныеПриборыУчетаМКД());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
			
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДействующиеПриборыУчетаМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Организация КАК Организация,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Район КАК Район,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.МКД КАК МКД,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.УзелУчета КАК УзелУчета,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВведенныеПриборы
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУзловУчетаМКД.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД, ТочкаУчета, УзелУчета, ТипИзмерителя, ПриборУчета) В
	|				(ВЫБРАТЬ
	|					ПриборыУзловУчета.Организация КАК Организация,
	|					ПриборыУзловУчета.Район КАК Район,
	|					ПриборыУзловУчета.МКД КАК МКД,
	|					ПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|					ПриборыУзловУчета.УзелУчета КАК УзелУчета,
	|					ПриборыУзловУчета.ТипИзмерителя КАК ТипИзмерителя,
	|					ПриборыУзловУчета.ПриборУчета КАК ПриборУчета
	|				ИЗ
	|					ПриборыУзловУчета КАК ПриборыУзловУчета)) КАК энргСостояниеПриборовУзловУчетаМКДСрезПоследних
	|ГДЕ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	
	////
	////"ВЫБРАТЬ
	////|	СостояниеПриборов.Организация КАК Организация,
	////|	СостояниеПриборов.Район КАК Район,
	////|	СостояниеПриборов.МКД КАК МКД,
	////|	СостояниеПриборов.ТочкаУчета КАК ТочкаУчета,
	////|	СостояниеПриборов.ПриборУчета КАК ПриборУчета
	////|ПОМЕСТИТЬ ВведенныеПриборы
	////|ИЗ
	////|	РегистрСведений.энргСостояниеПриборовМКД.СрезПоследних(
	////|			&Период,
	////|			(Организация, Район, МКД, ТочкаУчета, ПриборУчета) В
	////|				(ВЫБРАТЬ
	////|					ПриборыДействующихТочек.Организация,
	////|					ПриборыДействующихТочек.Район,
	////|					ПриборыДействующихТочек.МКД,
	////|					ПриборыДействующихТочек.ТочкаУчета,
	////|					ПриборыДействующихТочек.ПриборУчета
	////|				ИЗ
	////|					ПриборыДействующихТочек КАК ПриборыДействующихТочек)) КАК СостояниеПриборов
	////|ГДЕ
	////|	СостояниеПриборов.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаАктивныеПриборыУчетаМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	СостояниеПриборов.Организация КАК Организация,
	|	СостояниеПриборов.Район КАК Район,
	|	СостояниеПриборов.МКД КАК МКД,
	|	СостояниеПриборов.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеПриборов.ПриборУчета КАК ПриборУчета	
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовМКД.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД, ТочкаУчета, ПриборУчета) В
	|				(ВЫБРАТЬ
	|					ПриборыДействующихТочекМКД.Организация,
	|					ПриборыДействующихТочекМКД.Район,
	|					ПриборыДействующихТочекМКД.МКД,
	|					ПриборыДействующихТочекМКД.ТочкаУчета,
	|					ПриборыДействующихТочекМКД.ПриборУчета
	|				ИЗ
	|					ПриборыДействующихТочекМКД КАК ПриборыДействующихТочекМКД)) КАК СостояниеПриборов
	|ГДЕ
	|	СостояниеПриборов.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
